class AppStrings{
  static const String abstractText1 = 'عملية تغيير مفصل الورك:';
  static const String abstractText2 = 'اثناء استبدال مفصل الورك يزيل الجراح الاجزاء التالفة من مفصل الورك ويستبدلها بأجزاء صناعية. يساعد هذا المفصل الاصطناعي (الطرف الاصطناعي) علي تقليل الالم ونحسين الوظيفة.';
  static const String abstractText3 = 'قد تكون جراحة استبدال مفصل الورك خيارًا مناسبًا لك إذا كان ألم الورك يتعارض مع الانشطة اليومية، ولم تساعد العلاجات غير الجراحية أو لم تَعد فعالة. والتلف الناتج عن (التهاب المفاصل) هو السبب الاكثر شيوعا للحاجة إلى استبدال مفصل الورك.';
  static const String abstractText4 = 'لماذا يتم إجراء العملية؟';
  static const String abstractText5 = 'من ضمن الحالات التي يمكنها تدمير مفصل الورك وتتطلب أحيانًا إجراء جراحة استبدال مفصل الورك ما يأتي:\n- الالتهاب المفصلي العظمي.\n- التهاب المفاصل الروماتويدي.\n- النخر العظمي: إذا لم يصل ما يكفي من الدم إلى الجزء الكروي من مفصل الورك، نتيجة الخلع أو الكسر، فقد ينهار العظم ويتشوه.';
  static const String abstractText6 = 'قد تكون جراحة استبدال مفصل الورك خيارًا إذا كان ألم الورك:';
  static const String abstractText7 = '- مستمرًا على الرغم من تناول مسكنات الآلام.\n- يزداد سوءًا عند المشي، حتى مع استخدام عصا المشي أو المشّاية.\n- يمنع النوم.\n- يؤثر في القدرة على صعود الدَّرَج أو نزوله.\n- يجعل من الصعب عليك النهوض من وضعية الجلوس.';
  static const String exerciseText1 = 'تساعد تمارين مفصل الورك الصناعي الاتية في استقرار مفصل الورك من خلال تقوية عضالت الورك،\nالتخلص من الالم المرافق لمفصل الورك،\nزيادة مجال حركة مفصل الورك،\nالتقليل من خطر الاصابات المستقبلية للمفصل،\nزيادة مرونة عضلات الورك.';
  static const String exerciseText2 ='1- مضخات الكاحل';
  static const String exerciseText3 ='- حرك قدميك لأعلى ولأسفل عن طريق سحب قدميك لأعلى نحوك، ثم دفع قدميك لأسفل بعيدا عنك.';
  static const String exerciseText4 ='2- تمارين زحف كعب القدم';
  static const String exerciseText5 ='- ثني وركك وركبتك المصابه عن طريق تحريك كعبك نحو الأرداف مع الحفاظ على كعبك على السرير.\n \n- حرك كعبك مرة أخرى إلى وضع البداية واسترخ.';
  static const String exerciseText6 ='3- تمارين ضغط الفخذ';
  static const String exerciseText7 ='- شد العضلات في الجزء العلوي من فخذك عن طريق دفع الجزء الخلفي من ركبتك لأسفل إلى السرير.\n\n- انتظر لمدة 5 ثوان واسترخ.';
  static const String exerciseText8 ='4- تمارين رفع الساق باستقامة';
  static const String exerciseText9 ='يمكنك القيام بتمرين رفع الساق المستقيمة كالاتي:\n\n- استلق علي ظهرك واثن ساقك السليمة ثم قم برفع الساق التي تمت فيها الجراحة مع المحافظة على استقامة ركبتك بالكامل على السرير.\n\n- ارفع ساقك نحو 30 سم.\n\n- استمر لمدة 10-5 ثوان ثم أنزلها ببطء.';
  static const String exerciseText10 ='5- تمارين الجسر';
  static const String exerciseText11 ='تمرين الجسر هو أحد تمارين القوة لمفصل الورك، ويجب القيام بهذا التمرين من خالل اتباع الخطوات الاتية:\n\n- النوم على الظهر ثم قم بثني الركبتين\n \n- رفع عضلات الأرداف عن مستوى الأرض باستخدام الاقدام إلى أن يصبح الجسم باستقامة مع الركبتين.\n\n- المحافظة علي الوضعية لمدة 3 ثوان ثم ببطء يتم انزال الجسم الي مستوي الارض';
  static const String exerciseText12 ='6- تمارين القرفصاء';
  static const String exerciseText13 ='يمكن القيام بتمرين القرفصاء من خلال اتباع الخطوات الاتية:\n\n- الوقوف بشكل مستقيم مع وضع القدمين بنفس مسافة الكتفين،\n\n- خفض مستوى الجسم من خلال ثني الركبتين، حتى يصبح مستوى الركبتين فوق مستوى أصابع القدم، مع الحفاظ على استقامة الظهر.\n\n- الحفاظ على هذه الوضعية لبضعة ثوان، ثم رفع الجسم بشكل بطيء.';
  static const String warningText1='توفر هذه النشرة معلومات مهمة مصممة لمنع حدوث مضاعفات ما بعد الجراحة في الورك أثناء تعافي الأوتار والعضلات. يمكن ان تساعد احتياطات الورك التالية في منع الضغط غير المبرر علي الورك الجديد وتقليل خطر خلع الورك. ويجب اتباع هذه الاحتياطات الرئيسية لمدة 6 اسابيع علي الاقل';
  static const String warningText2='لا تلوي ساقك للداخل او للخارج حاول الحفاظ علي ان تتوجهان للامام او للاعلي.';
  static const String warningText3='لا تضع احدي ساقيك علي الاخري عند الجلوس.';
  static const String warningText4='اجلس مع وضع الفخذين في وضع اعلي من الركبتين';
  static const String warningText5='اجلس علي كرسي ذو مساند للذراعين وتجنب الكراسي الهزازة';
  static const String warningText6='لا تُربع ساقيك عند الجلوس';
  static const String warningText7='حافظ علي توجيه اصابع قدميك والركبتين الي الامام.';
  static const String warningText8='استخدم ساقك السليمة مع ذراعك لتحميل وزنك لمساعدتك علي الوقوف.';
  static const String warningText9='حافظ علي مساحة واسعة لدعمك عند الدوران لضمان توازنك.';
  static const String warningText10='لا تنحني للامام للوقوف.';
  static const String warningText11='لا نرفع الاشياء من الارض.';
  static const String warningText12='لا تثني ساقيك للداخل عند الدوران.';
  static const String warningText13='لا تثني ركبتك لاكثر من 90 درجة عند الوقوف او الجلوس.';
  static const String warningText14='عند النوم علي ظهرك او احد الجانبين تأكد من وجود وسادة بين القدمين.';
  static const String warningText15='استخدام أداة الوصول لمساعدتك علي سحب الغطاء وتجنب ثني جسدك.';
  static const String warningText16='لا تدع قدميك تتحرك للداخل او الخارج.';
  static const String warningText17='لا تنحني لسحب البطانية او الغطاء.';
  static const String warningText18='عند الصعود الي السرير ارفع قدمك السليمة اولا ثم المصابة.';
  static const String warningText19='تأكد ان السرير ليس منخفضًا جدًا.';
  static const String warningText20='عند النزول من السرير أنزل قدمك المصابة اولًا.';
  static const String warningText21='قم بتحريك مقعد السيارة للخلف قدر الامكان وقم بإمالة المقعد للأسفل.';
  static const String warningText22='قم بالجلوس علي المقعد مع ادخال الساقين والرجوع للوراء بجسدك.';
  static const String warningText23='أعد المقعد للوضع المستقيم.';
  static const String warningText24='لا يمكنك قيادة السيارة قبل مرور 6 اسابيع وسماح الجراح اولًا.';
  static const String warningText25='استخدم معدات الاستحمام إذا أوصي بها الطبيب لإكمال الاستحمام وانت جالس (كرسي).';
  static const String warningText26='استدم أدوات المساعدة ذات المقبض الطويل في غسل قدميك.';
  static const String warningText27='لا تنحني ابدًا لتجفيف قدمك او غسلها.';



}