class AppStrings{
  static const String abstractText1 = 'عملية تغيير مفصل الورك:';
  static const String abstractText2 = 'اثناء استبدال مفصل الورك يزيل الجراح الاجزاء التالفة من مفصل الورك ويستبدلها بأجزاء صناعية. يساعد هذا المفصل الاصطناعي (الطرف الاصطناعي) علي تقليل الالم ونحسين الوظيفة.';
  static const String abstractText3 = 'قد تكون جراحة استبدال مفصل الورك خيارًا مناسبًا لك إذا كان ألم الورك يتعارض مع الانشطة اليومية، ولم تساعد العلاجات غير الجراحية أو لم تَعد فعالة. والتلف الناتج عن (التهاب المفاصل) هو السبب الاكثر شيوعا للحاجة إلى استبدال مفصل الورك.';
  static const String abstractText4 = 'لماذا يتم إجراء العملية؟';
  static const String abstractText5 = 'من ضمن الحالات التي يمكنها تدمير مفصل الورك وتتطلب أحيانًا إجراء جراحة استبدال مفصل الورك ما يأتي:\n- الالتهاب المفصلي العظمي.\n- التهاب المفاصل الروماتويدي.\n- النخر العظمي: إذا لم يصل ما يكفي من الدم إلى الجزء الكروي من مفصل الورك، نتيجة الخلع أو الكسر، فقد ينهار العظم ويتشوه.';
  static const String abstractText6 = 'قد تكون جراحة استبدال مفصل الورك خيارًا إذا كان ألم الورك:';
  static const String abstractText7 = '- مستمرًا على الرغم من تناول مسكنات الآلام.\n- يزداد سوءًا عند المشي، حتى مع استخدام عصا المشي أو المشّاية.\n- يمنع النوم.\n- يؤثر في القدرة على صعود الدَّرَج أو نزوله.\n- يجعل من الصعب عليك النهوض من وضعية الجلوس.';
  static const String exerciseText1 = 'تساعد تمارين مفصل الورك الصناعي الآتية في استقرار مفصل الورك من خلال تقوية عضلات الورك، التخلص من الألم المرافق لمفصل الورك ، زيادة مجال حركة مفصل الورك ، التقليل من خطر الإصابات المستقبلية للمفصل ، زيادة مرونة عضلات الورك ومنها:';
  static const String exerciseText2 ='1- مضخات الكاحل';
  static const String exerciseText3 ='- حرك قدميك لأعلى ولأسفل عن طريق سحب قدميك لأعلى نحوك، ثم دفع قدميك لأسفل بعيدا عنك.\n\n- يُكرر من 20:10 مرة.';
  static const String exerciseText4 ='2- تمارين زحف كعب القدم';
  static const String exerciseText5 ='- اثني وركك وركبتك المصابه عن طريق تحريك كعبك نحو الأرداف مع الحفاظ على كعبك على السرير.\n \n- حرك كعبك مرة أخرى إلى وضع البداية واسترخ.\n\n- يُكرر من 20:10 مرة.';
  static const String exerciseText6 ='1- تمارين ضغط الفخذ';
  static const String exerciseText7 ='- اجلس على الأرض مع وضع ساقك المصابة أمامك مباشرة.\n\n- قم بشد العضلات الموجودة أعلى فخذك عن طريق الضغط على الجزء الخلفي من ركبتك بشكل مسطح حتى الأرض.\n\n- استمر لمدة 6 ثوانٍ تقريبًا، ثم استريح لمدة تصل إلى 10 ثوانٍ.\n\n- إذا شعرت بعدم الراحة أسفل ركبتك، فحاول وضع منشفة صغيرة تحت ركبتك أثناء هذا التمرين.\n\n- يُكرر 12:8 مرة في كل مجموعة من مرتين لثلاث مرات طوال اليوم.';
  static const String exerciseText8 ='2- تمارين رفع الساق باستقامة';
  static const String exerciseText9 ='يمكنك القيام بتمرين رفع الساق المستقيمة كالاتي:\n\n- استلق علي ظهرك واثن ساقك السليمة ثم قم برفع الساق التي تمت فيها الجراحة مع المحافظة على استقامة ركبتك بالكامل على السرير.\n\n- ارفع ساقك نحو 30 سم.\n\n- استمر لمدة 10-5 ثوان ثم أنزلها ببطء.';
  static const String exerciseText10 ='3- تمارين الجسر';
  static const String exerciseText11 ='تمرين الجسر هو أحد تمارين القوة لمفصل الورك، ويجب القيام بهذا التمرين من خالل اتباع الخطوات الاتية:\n\n- النوم على الظهر ثم قم بثني الركبتين\n \n- رفع عضلات الأرداف عن مستوى الأرض باستخدام الاقدام إلى أن يصبح الجسم باستقامة مع الركبتين.\n\n- المحافظة علي الوضعية لمدة 3 ثوان ثم ببطء يتم انزال الجسم الي مستوي الارض';
  static const String exerciseText12 ='4- تمارين القرفصاء';
  static const String exerciseText13 ='يمكن القيام بتمرين القرفصاء من خلال اتباع الخطوات الاتية:\n\n- الوقوف بشكل مستقيم مع وضع القدمين بنفس مسافة الكتفين،\n\n- خفض مستوى الجسم من خلال ثني الركبتين، حتى يصبح مستوى الركبتين فوق مستوى أصابع القدم، مع الحفاظ على استقامة الظهر.\n\n- الحفاظ على هذه الوضعية لبضعة ثوان، ثم رفع الجسم بشكل بطيء.';
  static const String exerciseText14 = 'تمارين توزيع الوزن';
  static const String exerciseText15 ='- ضع قدميك على مسافة أوسع قليلاً من عرض الكتفين.\n\n- ركز على ممارسة ضغط متساوي على كلا القدمين.\n\n- قم بإجراء حركات جنبًا إلى جنب عن طريق نقل وزنك من ساق إلى أخرى.\n\n- انقل وزنك إلى الساق اليمنى واستمر لمدة 5 ثوانٍ.\n\n- يُكرر 15 مرة ثلاث مرات في اليوم.';
  static const String exerciseText16 = '2- عضلات باطن الركبة';
  static const String exerciseText17 = '- استلق على الأرض ووجهك للأعلى، ثم قم بلف منشفة أو شريط مقاومة حول كرة القدم.\n\n- قم بتمديد الساق بلطف إلى الأعلى.\n\n- حافظ على استقامة الركبتين، مع إبقاء الساق المقابلة مسطحة على الأرض مراعاة استرخاء الكاحل لتمديد الساق وأوتار الركبة.\n\n- يرجي الثبات  لمدة 20:30 ثانية.\n\n- يُكرر من 3:5 مرات.';

  static const String exerciseText18 = '1- عضلات الفخذ الأمامية';
  static const String exerciseText19 = '- من وضعية الوقوف مع ضم ركبتيك معًا، ارفع قدمًا واحدة وأمسكها بيدك.\n\n- اضغط برفق على قدمك نحو المؤخرة حتى تشعر بالتمدد على طول الجزء الأمامي من فخذك.\n\n- استمر لمدة 10 إلى 20 ثانية.';

  static const String exerciseText20 = '3- عضلة باطن الساق';
  static const String exerciseText21 = '- اجلس على سريرك أو على الأرض مع مدّ ساقيك أمامك.\n\n- لف المنشفة حول كرة قدمك أسفل أصابع قدميك مباشرة.\n\n- اسحب المنشفة بلطف، مما يسمح لقدمك بالانحناء ببطء نحو ركبتك مع الحفاظ على استقامة ركبتك.\n\n-  يجب أن تشعر بشعور بسيط بالتمدد في الجزء الخلفي من أسفل ساقك. قد تشعر بالتمدد خلف كعبك أو ركبتك، اعتمادًا على مكان شد العضلات أو الوتر بشكل خاص.\n\n- حافظ على وضعية التمدد لمدة 15 إلى 30 ثانية، ثم حرر التمدد ببطء.\n\n- استرح لبضع ثوان ثم كرر التمدد 3 إلى 5 مرات.';

  static const String exerciseText22 = '4- عضلات الورك القابضة';
  static const String exerciseText23 = '- ابدأ بإمساك ركبتنا بيدك والحفاظ علي التوازن على القدم المقابلة.\n\n- اسحب قدمك ببطء نحو الأرداف حتى تصل تجربة تمدد مقبول على طول الجزء الأمامي من فخذك.\n\n- حاول الاستمرار لمدة 30 ثانية ثم عد ببطء إلى نقطة البداية.\n\n- كرر من 3:5  مرات.';

  static const String exerciseText24 = '5- تموجات أوتار الركبة';
  static const String exerciseText25 = '- استلقي على بطنك مع ركبتيك مستقيمة. إذا كانت ركبتك غير مريحة.\n\n-  قم بلف قطعة قماش وضعها تحت ساقك فوق ركبتك مباشرة.\n\n-  ارفع قدم ساقك المصابة عن طريق ثني الركبة بحيث ترفع القدم نحو الأرداف.\n\n-  إذا كانت هذه الحركة مؤلمة، جربها دون ثني ركبتك تمامًا لتجنب أي حركة مؤلمة.\n\n- قد ترغب أيضًا في إضافة وزن الكفة إلى كاحلك [ليس أكثر من 5 رطل (2 كجم)]، حول كاحلك.\n\n- لا يتعين عليك رفع ساقك أكثر من 12 بوصة (30 سم) للحصول على تمرين لأوتار الركبة.\n\n- يُكرر8:12  مرة في كل مجموعة من مرتين لثلاث مرات طوال اليوم.';

  static const String exerciseText26 = '6- تمرين العضلة الألوية الكبرى';
  static const String exerciseText27 = '-استلقي على ظهرك على سطح ثابت مع تمديد ساقيك.\n\n- اضغط على عضلات الأرداف معًا.\n\n- كرر عشر مرات أخري.\n\n- قُم بثلاث مجموعات من عشرة، ثلاث مرات في اليوم.';

  static const String exerciseText28 = '7- تمارين تقوية عضلات الفخذ الأمامية';
  static const String exerciseText29 = '- استلق على ظهرك مع ركبتيك للخارج بشكل مستقيم.\n\n- ضع مسندًا أسفل ركبة الرباعية التي ترغب في تقويتها.\n\n- قم بفرد ركبتك ببطء حتى يتم تقويم ساقك بالكامل. حافظ على الاتصال بالمسند طوال الوقت أثناء التمرين.\n\n- قم بشد عضلاتك الرباعية أثناء استقامة ركبتك. يجب أن تحاول فرد ركبتك بالكامل.\n\n- حافظ على وضعية الركبة المستقيمة لمدة ثلاث إلى خمس ثوان، ثم عد ببطء إلى وضع البداية.\n\n- يجب عليك تكرار التمرين من 10 إلى 15 تكرار مرتين أو ثلاث يوميًا.';


  static const String warningText1='توفر هذه النشرة معلومات مهمة مصممة لمنع حدوث مضاعفات ما بعد الجراحة في الورك أثناء تعافي الأوتار والعضلات. يمكن ان تساعد احتياطات الورك التالية في منع الضغط غير المبرر علي الورك الجديد وتقليل خطر خلع الورك. ويجب اتباع هذه الاحتياطات الرئيسية لمدة 6 اسابيع علي الاقل';
  static const String warningText2='لا تلوي ساقك للداخل او للخارج حاول الحفاظ علي ان تتوجهان للامام او للاعلي.';
  static const String warningText3='لا تضع احدي ساقيك علي الاخري عند الجلوس.';
  static const String warningText4='اجلس مع وضع الفخذين في وضع اعلي من الركبتين';
  static const String warningText5='اجلس علي كرسي ذو مساند للذراعين وتجنب الكراسي الهزازة';
  static const String warningText6='لا تُربع ساقيك عند الجلوس';
  static const String warningText7='حافظ علي توجيه اصابع قدميك والركبتين الي الامام.';
  static const String warningText8='استخدم ساقك السليمة مع ذراعك لتحميل وزنك لمساعدتك علي الوقوف.';
  static const String warningText9='حافظ علي مساحة واسعة لدعمك عند الدوران لضمان توازنك.';
  static const String warningText10='لا تنحني للامام للوقوف.';
  static const String warningText11='لا نرفع الاشياء من الارض.';
  static const String warningText12='لا تثني ساقيك للداخل عند الدوران.';
  static const String warningText13='لا تثني ركبتك لاكثر من 90 درجة عند الوقوف او الجلوس.';
  static const String warningText14='عند النوم علي ظهرك او احد الجانبين تأكد من وجود وسادة بين القدمين.';
  static const String warningText15='استخدام أداة الوصول لمساعدتك علي سحب الغطاء وتجنب ثني جسدك.';
  static const String warningText16='لا تدع قدميك تتحرك للداخل او الخارج.';
  static const String warningText17='لا تنحني لسحب البطانية او الغطاء.';
  static const String warningText18='عند الصعود الي السرير ارفع قدمك السليمة اولا ثم المصابة.';
  static const String warningText19='تأكد ان السرير ليس منخفضًا جدًا.';
  static const String warningText20='عند النزول من السرير أنزل قدمك المصابة اولًا.';
  static const String warningText21='قم بتحريك مقعد السيارة للخلف قدر الامكان وقم بإمالة المقعد للأسفل.';
  static const String warningText22='قم بالجلوس علي المقعد مع ادخال الساقين والرجوع للوراء بجسدك.';
  static const String warningText23='أعد المقعد للوضع المستقيم.';
  static const String warningText24='لا يمكنك قيادة السيارة قبل مرور 6 اسابيع وسماح الجراح اولًا.';
  static const String warningText25='استخدم معدات الاستحمام إذا أوصي بها الطبيب لإكمال الاستحمام وانت جالس (كرسي).';
  static const String warningText26='استدم أدوات المساعدة ذات المقبض الطويل في غسل قدميك.';
  static const String warningText27='لا تنحني ابدًا لتجفيف قدمك او غسلها.';



}